src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	ТекстКомментария = Комментарий.ПолучитьДанные;
	//Сообщить (ТекстКомментария);
	МассивПодстрок = СтрРазделить(ТекстКомментария, " ");
	Счетчик = 0;
	Для Каждого Элемент Из МассивПодстрок Цикл
		  Позиция = Найти(Элемент, "e1cib/");
		  Если Позиция > 0 Тогда
		  	НомерЭлементаССсылкой = Счетчик;
		  КонецЕсли;
		  Счетчик=Счетчик+1;
	КонецЦикла;
	НавигационнаяСсылка = МассивПодстрок[НомерЭлементаССсылкой];
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	Для Каждого ТекСтрокаТовары Из Объект.Товары Цикл
		 ТекСтрокаТовары.Сумма = ТекСтрокаТовары.Количество * ТекСтрокаТовары.Цена;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Для Каждого ТекСтрокаТовары Из Объект.Товары Цикл
		 ТекСтрокаТовары.Сумма = ТекСтрокаТовары.Количество * ТекСтрокаТовары.Цена;
	КонецЦикла;
КонецПроцедуры
